Tekla Open API Reference for Tekla Structures 2025
Line.Attributes Property
 The attributes for the line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Line.LineAttributes Attributes { get; set; }
Public Property Attributes As Line.LineAttributes
	Get
	Set
Property Value
Type: Line.LineAttributes
See Also
Reference
Line Class
Tekla.Structures.Drawing Namespace